org/kubernetes_on_gke_with_terraform.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: kubernetes_on_gke_with_terraform
#+TITLE: kubernetes on gke with terraform
* [[file:kubernetes.org][kubernetes]], [[file:cloud_computing.org][cloud computing]], [[file:google_cloud_platform.org][google cloud platform]]
* simple setup for just a cluster
** create a cluster with terraform on gke
*** https://github.com/terraform-google-modules/terraform-google-kubernetes-engine
*** https://www.github.com/gruntwork-io/terraform-google-gke/tree/master/main.tf
**** source:: https://www.google.com/amp/s/cloudblog.withgoogle.com/products/devops-sre/deploying-a-production-grade-helm-release-on-gke-with-terraform/amp/
** create an unmanaged cluster on linode
*** https://github.com/linode/terraform-linode-k8s
*** https://www.linode.com/docs/applications/configuration-management/terraform/how-to-provision-an-unmanaged-kubernetes-cluster-using-terraform/
* holistic organization setup
** overview of cloud foundation toolkit: https://github.com/GoogleCloudPlatform/cloud-foundation-toolkit/blob/master/docs/terraform.md
** example:: integration of cloud foundation modules: https://github.com/terraform-google-modules/terraform-example-foundation
*** https://github.com/terraform-google-modules/terraform-google-bootstrap
** select modules from the cloud-foundation-fabric: https://github.com/terraform-google-modules/cloud-foundation-fabric
** create a project: https://github.com/terraform-google-modules/terraform-google-project-factory
** create a cluster: https://github.com/terraform-google-modules/terraform-google-kubernetes-engine
* links
** https://www.terraform.io/docs/providers/google/guides/using_gke_with_terraform.html
** https://github.com/terraform-google-modules/terraform-google-kubernetes-engine
** https://github.com/terraform-google-modules/terraform-google-project-factory
** https://www.linode.com/docs/applications/configuration-management/terraform/how-to-provision-an-unmanaged-kubernetes-cluster-using-terraform/
- Use Terraform, the popular orchestration tool by HaschiCorp, to deploy a Kubernetes cluster on Linode. Linode’s Terraform K8s module creates a Kubernetes cluster running on the CoreOS ContainerLinux operating system. After creating a Master and worker nodes, the module connects through SSH to these instances and installs kubeadm, kubectl, and other Kubernetes binaries to /opt/bin. It also handles initializing kubeadm, joining worker nodes to the master, and configuring kubectl. For the cluster’s container networking interface, Calico is installed. Finally, a kubectl admin config file is installed to the local environment, which you can use to connect to your cluster’s API server.
